In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib notebook

# Read in all those csv files, take a look at what they contain

In [2]:
holidays_events = pd.read_csv("holidays_events.csv")
items = pd.read_csv("items.csv")
oil = pd.read_csv("oil.csv")
stores = pd.read_csv("stores.csv")
test = pd.read_csv("test.csv")
train = pd.read_csv("train.csv")
transactions = pd.read_csv("transactions.csv")

/anaconda/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2717: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
holidays_events.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [29]:
holidays_events['locale_name'].value_counts()

Ecuador                           174
Quito                              13
Guaranda                           12
Latacunga                          12
Riobamba                           12
Ambato                             12
Guayaquil                          11
Cuenca                              7
Ibarra                              7
Imbabura                            6
Puyo                                6
Loja                                6
Salinas                             6
Libertad                            6
Santo Domingo                       6
Manta                               6
Cotopaxi                            6
Esmeraldas                          6
Cayambe                             6
Santa Elena                         6
Santo Domingo de los Tsachilas      6
Quevedo                             6
Machala                             6
El Carmen                           6
Name: locale_name, dtype: int64

In [27]:
holidays_events[holidays_events['transferred'] == True]

,date,type,locale,locale_name,description,transferred
19,2012-10-09,Holiday,National,Ecuador,Independencia de Guayaquil,True
72,2013-10-09,Holiday,National,Ecuador,Independencia de Guayaquil,True
135,2014-10-09,Holiday,National,Ecuador,Independencia de Guayaquil,True
255,2016-05-24,Holiday,National,Ecuador,Batalla de Pichincha,True
266,2016-07-25,Holiday,Local,Guayaquil,Fundacion de Guayaquil,True
268,2016-08-10,Holiday,National,Ecuador,Primer Grito de Independencia,True
297,2017-01-01,Holiday,National,Ecuador,Primer dia del ano,True
303,2017-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,True
312,2017-05-24,Holiday,National,Ecuador,Batalla de Pichincha,True
324,2017-08-10,Holiday,National,Ecuador,Primer Grito de Independencia,True
328,2017-09-28,Holiday,Local,Ibarra,Fundacion de Ibarra,True
340,2017-12-06,Holiday,Local,Quito,Fundacion de Quito,True

In [28]:
holidays_events[holidays_events['type'] == 'Transfer']

,date,type,locale,locale_name,description,transferred
20,2012-10-12,Transfer,National,Ecuador,Traslado Independencia de Guayaquil,False
73,2013-10-11,Transfer,National,Ecuador,Traslado Independencia de Guayaquil,False
136,2014-10-10,Transfer,National,Ecuador,Traslado Independencia de Guayaquil,False
256,2016-05-27,Transfer,National,Ecuador,Traslado Batalla de Pichincha,False
265,2016-07-24,Transfer,Local,Guayaquil,Traslado Fundacion de Guayaquil,False
269,2016-08-12,Transfer,National,Ecuador,Traslado Primer Grito de Independencia,False
298,2017-01-02,Transfer,National,Ecuador,Traslado Primer dia del ano,False
304,2017-04-13,Transfer,Local,Cuenca,Fundacion de Cuenca,False
313,2017-05-26,Transfer,National,Ecuador,Traslado Batalla de Pichincha,False
325,2017-08-11,Transfer,National,Ecuador,Traslado Primer Grito de Independencia,False
329,2017-09-29,Transfer,Local,Ibarra,Fundacion de Ibarra,False
342,2017-12-08,Transfer,Local,Quito,Traslado Fundacion de Quito,False

In [4]:
holidays_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
date           350 non-null object
type           350 non-null object
locale         350 non-null object
locale_name    350 non-null object
description    350 non-null object
transferred    350 non-null bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB

In [5]:
items.head()

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [6]:
items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4100 entries, 0 to 4099
Data columns (total 4 columns):
item_nbr      4100 non-null int64
family        4100 non-null object
class         4100 non-null int64
perishable    4100 non-null int64
dtypes: int64(3), object(1)
memory usage: 128.2+ KB

In [7]:
items['family'].value_counts()

GROCERY I                     1334
BEVERAGES                      613
CLEANING                       446
PRODUCE                        306
DAIRY                          242
PERSONAL CARE                  153
BREAD/BAKERY                   134
HOME CARE                      108
DELI                            91
MEATS                           84
HOME AND KITCHEN I              77
LIQUOR,WINE,BEER                73
FROZEN FOODS                    55
POULTRY                         54
HOME AND KITCHEN II             45
EGGS                            41
CELEBRATION                     31
LAWN AND GARDEN                 26
PREPARED FOODS                  26
LADIESWEAR                      21
LINGERIE                        20
AUTOMOTIVE                      20
BEAUTY                          19
PLAYERS AND ELECTRONICS         17
SCHOOL AND OFFICE SUPPLIES      15
GROCERY II                      14
PET SUPPLIES                    14
SEAFOOD                          8
MAGAZINES                        6
HARDWARE                         4
HOME APPLIANCES                  1
BABY CARE                        1
BOOKS                            1
Name: family, dtype: int64

In [10]:
items.nunique()

item_nbr      4100
family          33
class          337
perishable       2
dtype: int64

In [6]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [7]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
date          1218 non-null object
dcoilwtico    1175 non-null float64
dtypes: float64(1), object(1)
memory usage: 19.1+ KB

In [8]:
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [13]:
stores.nunique()

store_nbr    54
city         22
state        16
type          5
cluster      17
dtype: int64

In [9]:
test.head()

          id        date  store_nbr  item_nbr  onpromotion
0  125497040  2017-08-16          1     96995        False
1  125497041  2017-08-16          1     99197        False
2  125497042  2017-08-16          1    103501        False
3  125497043  2017-08-16          1    103520        False
4  125497044  2017-08-16          1    103665        False

In [10]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3370464 entries, 0 to 3370463
Data columns (total 5 columns):
id             int64
date           object
store_nbr      int64
item_nbr       int64
onpromotion    bool
dtypes: bool(1), int64(3), object(1)
memory usage: 106.1+ MB

In [17]:
test['onpromotion'].value_counts()

False    3171867
True      198597
Name: onpromotion, dtype: int64

In [11]:
train.head()

   id        date  store_nbr  item_nbr  unit_sales onpromotion
0   0  2013-01-01         25    103665         7.0         NaN
1   1  2013-01-01         25    105574         1.0         NaN
2   2  2013-01-01         25    105575         2.0         NaN
3   3  2013-01-01         25    108079         1.0         NaN
4   4  2013-01-01         25    108701         1.0         NaN

In [16]:
train['onpromotion'].value_counts()

False    96028767
True      7810622
Name: onpromotion, dtype: int64

In [12]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125497040 entries, 0 to 125497039
Data columns (total 6 columns):
id             int64
date           object
store_nbr      int64
item_nbr       int64
unit_sales     float64
onpromotion    object
dtypes: float64(1), int64(3), object(2)
memory usage: 5.6+ GB

In [13]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [14]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
date            83488 non-null object
store_nbr       83488 non-null int64
transactions    83488 non-null int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [15]:
transactions.nunique()

date            1682
store_nbr         54
transactions    4993
dtype: int64

## Take a look at their NaN values

In [14]:
transactions.isnull().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [15]:
train.isnull().sum()

id                    0
date                  0
store_nbr             0
item_nbr              0
unit_sales            0
onpromotion    21657651
dtype: int64

In [16]:
#take a look at the onpromotion column, see if it only has "NaN" and "True" value
#so we can fill all NaN value with False
#But seems that it has "true", "false" and NaN values
train['onpromotion'].value_counts()

False    96028767
True      7810622
Name: onpromotion, dtype: int64

In [17]:
#take a look at those "onpromotion", "not on promotion", and NaN, find their difference
train[train['onpromotion'] == True].head()

                id        date  store_nbr  item_nbr  unit_sales onpromotion
21668391  21668391  2014-04-01          9    414354        11.0        True
21668820  21668820  2014-04-01          9    874593        33.0        True
21668931  21668931  2014-04-01          9    999545         2.0        True
21669011  21669011  2014-04-01          9   1057515         1.0        True
21669094  21669094  2014-04-01          9   1119217         2.0        True

In [18]:
#take a look at those "onpromotion", "not on promotion", and NaN, find their difference
train[train['onpromotion'] == False].head()

                id        date  store_nbr  item_nbr  unit_sales onpromotion
21657651  21657651  2014-04-01          1    103520         1.0       False
21657652  21657652  2014-04-01          1    103665         3.0       False
21657653  21657653  2014-04-01          1    105574         1.0       False
21657654  21657654  2014-04-01          1    105575        11.0       False
21657655  21657655  2014-04-01          1    105577         4.0       False

In [19]:
#take a look at those "onpromotion", "not on promotion", and NaN, find their difference
train[train['onpromotion'].isnull()].head()

   id        date  store_nbr  item_nbr  unit_sales onpromotion
0   0  2013-01-01         25    103665         7.0         NaN
1   1  2013-01-01         25    105574         1.0         NaN
2   2  2013-01-01         25    105575         2.0         NaN
3   3  2013-01-01         25    108079         1.0         NaN
4   4  2013-01-01         25    108701         1.0         NaN

In [20]:
test.isnull().sum()

id             0
date           0
store_nbr      0
item_nbr       0
onpromotion    0
dtype: int64

In [21]:
stores.isnull().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [22]:
oil.isnull().sum()

date           0
dcoilwtico    43
dtype: int64

In [23]:
items.isnull().sum()

item_nbr      0
family        0
class         0
perishable    0
dtype: int64

In [24]:
holidays_events.isnull().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

# Join tables together

## concatenate train and test together first

In [25]:
train['source'] = 'train'
test['source'] = 'test'
df_001 = pd.concat([train, test], axis = 0)
df_001.head()

         date  id  item_nbr onpromotion source  store_nbr  unit_sales
0  2013-01-01   0    103665         NaN  train         25         7.0
1  2013-01-01   1    105574         NaN  train         25         1.0
2  2013-01-01   2    105575         NaN  train         25         2.0
3  2013-01-01   3    108079         NaN  train         25         1.0
4  2013-01-01   4    108701         NaN  train         25         1.0

In [26]:
df_001.isnull().sum()

date                  0
id                    0
item_nbr              0
onpromotion    21657651
source                0
store_nbr             0
unit_sales      3370464
dtype: int64

## Join holiday table

In [ ]:
df_002 = df_001.merge(holidays_events)

## Join oil table and df_001 table

In [27]:
df_002 = df_001.merge(oil, on='date', how = 'left')
#df_002.head(30)

In [28]:
#df_002[df_002['date'] == '2013-01-02']

In [29]:
df_002.isnull().sum()

date                  0
id                    0
item_nbr              0
onpromotion    21657651
source                0
store_nbr             0
unit_sales      3370464
dcoilwtico     41365546
dtype: int64

In [1]:
def sum_dig_pow(a, b): # range(a, b + 1) will be studied by the function
    # your code here
    final = []
    for i in range(a, b+1):
        str_i = str(i)
        len_i = len(str_i)
        result = 0
        for s in str_i:
            result = result + int(s) ** (str_i.index(s) + 1)
        if result == i:
            final.append(i)
    return final

In [7]:
sum_dig_pow(0, 1677)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 89, 135, 175, 518, 598, 1306]

In [13]:
result = 0
str_i = '1676'
for s in str_i:
    result = result + int(s) ** (str_i.index(s) + 1)
    print(str_i.index(s))
    print(result)

0
1
1
37
2
380
1
416

In [16]:
for c in 'test':
    print ('test'.index(c))

0
1
2
0